<p><strong>Приступим!</strong></p>
    <ul>
        <li>
            <section>
                В первую очередь Вы наверняка захотите узнать каким образом вообще можно выполнить вход в какую-либо учетную запись?
                Сделать это достаточно просто. Запомните, в этом Вам поможет команда <strong>ssh имя_пользователя@ip_адрес</strong>.
                Таким нехитрым способом Вы можете получить доступ к учетной записи пользователя в сети. И вот небольшая подсказка: в контексте этой задачи после @ можете просто написать localhost.
                Но помните, что только в контексте этой задачи =).
            </section>
        </li>
        <li>
            <section>
                Что ж, теперь неплохо бы разобраться с тем, как перемещаться по папкам в этом терминале.
                Тут, пожалуй, еще проще, Вам поможет команда <strong>cd</strong>.
                Введите <strong>cd имя_папки</strong> и из текущей папки попадете в ту, имя который Вы указали (ну если конечно такая папка там имеется).
                Если вдруг придется перейти в папку уровнем выше, то введите <strong>cd ..</strong>, двумя <strong>cd ../..</strong>, ну и так далее, думаю с этим понятно).
                При желании оказаться в домашней директории текущего пользователя <strong>cd ~</strong>, и будет Вам счастье.               
            </section>
        </li>
        <li>
            <section>
                С навигацией в терминале разобрались, а как насчет того, чтобы просмотреть содержимое папок, пригодится верно?
                И тут в чат заходит команда <strong>ls</strong>. Введите сие чудо в терминале и увидите все содержимое текущей папки (ну почти все, но об это чуть-чуть позже).
                Вы увидите названия доступных папок и ПОЧТИ всех файлов. А чтобы увидеть ну прямо совсем все файлы не забудьте применить <strong>ls -a</strong>.
                Тогда Вашему взору откроются скрытые файлы (их отличительная черта это точка перед названием).
            </section>
        </li>
        <li>
            <section>
                И теперь, когда мы знаем какие файлы нам достпны, надо бы еще посмотреть, что же в них написано.
                А тут на помощь будущим хакерам приходит кот... ну то есть команда <strong>cat</strong>.
                Добавьте к ней имена файлов, с содержанием которых хотели бы ознакомиться, и вот он - успех!
            </section>
        </li>
    </ul>
<p>А теперь вперед, друзья, время действовать!</p>